Duet3D/Duet3Expansion/src/atmel/SAMD10_DFP/1.1.68/atdf/ATSAMD10D13AS.atdf
      <value-group name="NVMCTRL_CTRLB__RWS">
        <value name="SINGLE" caption="Single Auto Wait State" value="0"/>
        <value name="HALF" caption="Half Auto Wait State" value="1"/>
        <value name="DUAL" caption="Dual Auto Wait State" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__SLEEPPRM">
        <value name="WAKEONACCESS" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access." value="0"/>
        <value name="WAKEUPINSTANT" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep." value="1"/>
        <value name="DISABLED" caption="Auto power reduction disabled." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
    </module>
    <module name="FUSES" id="U2207" version="1.0.7" caption="Non-Volatile Fuses">
      <register-group name="OTP4_FUSES">
        <register name="OTP4_WORD_0" offset="0x0" size="4" rw="R" caption="OTP4 Page Word 0">
          <bitfield name="ADC_LINEARITY_0" caption="ADC Linearity bits 4:0" mask="0xF8000000"/>
        </register>
        <register name="OTP4_WORD_1" offset="0x4" size="4" rw="R" caption="OTP4 Page Word 1">
          <bitfield name="ADC_LINEARITY_1" caption="ADC Linearity bits 7:5" mask="0x7"/>
          <bitfield name="ADC_BIASCAL" caption="ADC Bias Calibration" mask="0x38"/>
          <bitfield name="OSC32K" caption="OSC32K Calibration" mask="0x1FC0"/>
          <bitfield name="DFLL48M_COARSE_CAL" caption="DFLL48M Coarse Calibration" mask="0xFC000000"/>
        </register>
        <register name="OTP4_WORD_2" offset="0x8" size="4" rw="R" caption="OTP4 Page Word 2">
          <bitfield name="DFLL48M_FINE_CAL" caption="DFLL48M Fine Calibration" mask="0x3FF"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" size="4" rw="R" caption="TEMP_LOG Page Word 0">
          <bitfield name="ROOM_TEMP_VAL_INT" caption="Integer part of room temperature in oC" mask="0xFF"/>
          <bitfield name="ROOM_TEMP_VAL_DEC" caption="Decimal part of room temperature" mask="0xF00"/>
          <bitfield name="HOT_TEMP_VAL_INT" caption="Integer part of hot temperature in oC" mask="0xFF000"/>
          <bitfield name="HOT_TEMP_VAL_DEC" caption="Decimal part of hot temperature" mask="0xF00000"/>
          <bitfield name="ROOM_INT1V_VAL" caption="2's complement of the internal 1V reference drift at room temperature (versus a 1.0 centered value)" mask="0xFF000000"/>
        </register>
        <register name="TEMP_LOG_WORD_1" offset="0x4" size="4" rw="R" caption="TEMP_LOG Page Word 1">
          <bitfield name="HOT_INT1V_VAL" caption="2's complement of the internal 1V reference drift at hot temperature (versus a 1.0 centered value)" mask="0xFF"/>
          <bitfield name="ROOM_ADC_VAL" caption="12-bit ADC conversion at room temperature" mask="0xFFF00"/>
          <bitfield name="HOT_ADC_VAL" caption="12-bit ADC conversion at hot temperature" mask="0xFFF00000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" size="4" rw="RW" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_BOOTPROT" caption="Bootloader Size" mask="0x7"/>
          <bitfield name="NVMCTRL_EEPROM_SIZE" caption="EEPROM Size" mask="0x70"/>
          <bitfield name="BOD33USERLEVEL" caption="BOD33 User Level" mask="0x3F00"/>
          <bitfield name="BOD33_EN" caption="BOD33 Enable" mask="0x4000"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0x18000"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x2000000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x4000000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0x78000000"/>
          <bitfield name="WDT_WINDOW_0" caption="WDT Window bit 0" mask="0x80000000"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" size="4" rw="RW" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW_1" caption="WDT Window bits 3:1" mask="0x7"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0x78"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x80"/>
          <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x100"/>
          <bitfield name="NVMCTRL_REGION_LOCKS" caption="NVM Region Locks" mask="0xFFFF0000"/>
        </register>
      </register-group>
    </module>
    <module name="PAC" id="U2211" version="1.0.1" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WPCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:WPCLR" initval="0x00000000" caption="Write Protection Clear">
          <bitfield name="WP" caption="Write Protection Clear" mask="0xFFFFFFFE"/>
        </register>
        <register name="WPSET" offset="0x4" rw="RW" size="4" atomic-op="set:WPSET" initval="0x00000000" caption="Write Protection Set">
          <bitfield name="WP" caption="Write Protection Set" mask="0xFFFFFFFE"/>
        </register>
      </register-group>
    </module>
    <module name="PM" id="U2206" version="2.1.1" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x4"/>
          <bitfield name="BKUPCLK" caption="Backup Clock Select" mask="0x10"/>
        </register>
